def admin_menu():
    """管理员界面菜单"""
    print("="*30)
    print(f"{"功能菜单":^30}")
    print("-"*30)
    print(f"""
      {"1.创建教师/学生账号"}
      {"2.删除教师/学生账号"}
      {"3.修改账号信息"}
      {"4.查看所有账号"}
      {"5.修改密码"}
      {"0.退出系统"}
          """)
    print("-"*30)
    print("输入数字进行选择")
    print("="*30)

def teacher_menu():
    """教师界面菜单"""
    print("="*30)
    print(f"{"功能菜单":^30}")
    print("-"*30)
    print(f"""
      {"1.增加课程"}
      {"2.录入成绩"}
      {"3.修改密码"}
      {"0.退出系统"}
          """)
    print("-"*30)
    print("输入数字进行选择")
    print("="*30)

def student_menu():
    """学生界面菜单"""
    print("="*30)
    print(f"{"功能菜单":^30}")
    print("-"*30)
    print(f"""
      {"1.查看成绩"}
      {"2.查看排名"}
      {"3.查看绩点"}
      {"4.修改密码"}
      {"0.退出系统"}
          """)
    print("-"*30)
    print("输入数字进行选择")
    print("="*30)
